simulations/cavity_openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        nFaces          3200;
        startFace       3120;
    }
    fixedWalls
    {
        type            wall;
        physicalType    patch;
        nFaces          120;
        startFace       6320;
    }
    movingWall
    {
        type            wall;
        physicalType    patch;
        nFaces          40;
        startFace       6440;
    }
)

// ************************************************************************* //
