simulations/cavity_openfoam/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs    ("libsampling.so");
interpolationScheme cellPoint;
setFormat csv;

sets
(
    midLine
    {
        type    uniform;
        axis    y;
        start   (0.5 0 0.05);
        end     (0.5 1 0.05);
        nPoints 100;
    }
);

fields (U);
